import csv

data = [{'직업': '디스트로이어', '각인서': 1, '가격': 50},
        {'직업': '워로드', '각인서': 1, '가격': 50},
        {'직업': '버서커', '각인서': 1, '가격': 50},
        {'직업': '홀리나이트', '각인서': 1, '가격': 50},
        {'직업': '슬레이어', '각인서': 1, '가격': 50},
        {'직업': '배틀마스터', '각인서': 1, '가격': 50},
        {'직업': '인파이터', '각인서': 1, '가격': 50},
        {'직업': '기공사', '각인서': 1, '가격': 50},
        {'직업': '창술사', '각인서': 1, '가격': 50},
        {'직업': '스트라이커', '각인서': 1, '가격': 50},
        {'직업': '데빌헌터', '각인서': 1, '가격': 50},
        {'직업': '블래스터', '각인서': 1, '가격': 50},
        {'직업': '호크아이', '각인서': 1, '가격': 50},
        {'직업': '스카우터', '각인서': 1, '가격': 50},
        {'직업': '건슬링어', '각인서': 1, '가격': 50},
        {'직업': '바드', '각인서': 1, '가격': 50},
        {'직업': '서머너', '각인서': 1, '가격': 50},
        {'직업': '아르카나', '각인서': 1, '가격': 50},
        {'직업': '소서리스', '각인서': 1, '가격': 50},
        {'직업': '블레이드', '각인서': 1, '가격': 50},
        {'직업': '데모닉', '각인서': 1, '가격': 50},
        {'직업': '리퍼', '각인서': 1, '가격': 50},
        {'직업': '소울이터', '각인서': 1, '가격': 50},
        {'직업': '도화가', '각인서': 1, '가격': 50},
        {'직업': '기상술사', '각인서': 1, '가격': 50},
        ]

csv_file = 'price.csv'

with open(csv_file, 'w', encoding='utf-8-sig', newline='') as csvfile:
    fieldnames = ['직업', '각인서', '가격']
    writer = csv.DictWriter(csvfile, fieldnames=fieldnames)

    writer.writeheader()
    writer.writerows(data)

print(f'데이터가 {csv_file}에 저장되었습니다.')
