import csv

data = [{'단어': '싫어', '점수': -1},
        {'단어': '노잼', '점수': -1},
        {'단어': '문제', '점수': -1},
        {'단어': '접길', '점수': -1},
        {'단어': '노답', '점수': -1},
        {'단어': '누워', '점수': -2},
        {'단어': '거절', '점수': -2},
        {'단어': '거절율', '점수': -1},
        {'단어': '못해', '점수': -1},
        {'단어': '박살', '점수': -2},
        {'단어': '버그', '점수': -1},
        {'단어': '접습니다', '점수': -3},
        {'단어': '버려', '점수': -2},
        {'단어': '포기', '점수': -1},
        {'단어': '약해', '점수': -1},
        {'단어': '단점', '점수': -1},
        {'단어': '시발', '점수': -2},
        {'단어': 'ㅅㅂ', '점수': -2},
        {'단어': 'ㅄ', '점수': -2},
        {'단어': '병신', '점수': -2},
        {'단어': '싸개', '점수': -1},
        {'단어': '●', '점수': -1},
        ]

csv_file = 'score.csv'

with open(csv_file, 'w', encoding='utf-8-sig', newline='') as csvfile:
    fieldnames = ['단어', '점수']
    writer = csv.DictWriter(csvfile, fieldnames=fieldnames)

    writer.writeheader()
    writer.writerows(data)

print(f'데이터가 {csv_file}에 저장되었습니다.')
